<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

     'template'               => [
         // 模板后缀
        'view_suffix'  => 'html',
    ],
	//分页配置
	    'paginate'               => [
	        'type'      => 'AjaxBootstrap',
	        'var_page'  => 'page',
	        'list_rows' => 15,
	    ],
	//输出替换后台样式路径
	'view_replace_str'  =>  [
    '__PUBLIC__'=>'/public/',
	'__UPLOADS__' => '/public/uploads',
    '__ROOT__' => '/',
	'__INDEX__' => '/public/static/index',
	
]
];
